/*      ****************************************************************************************************      */
/*      上机作业：（lab8）   链式存储结构下队列的基本操作                                                         */
/*      ****************************************************************************************************      */
/*                                                                                                                */
/*  利用自编的子程序实现以下功能：                                                                                */
/*  ①创建一个空队列；                                                                                            */
/*  ②判断新建的队列是否为空；                                                                                    */
/*  ③提示用户输入"队列的长度"；                                                                                  */
/*  ④根据用户输入的"队列的长度"，逐一提示用户输入"队列中的各个元素"，完成队列的构造；                            */
/*  ⑤判断此时的队列是否为空；                                                                                    */
/*  ⑥调用子程序打印当前队列的队首元素和队尾元素；                                                                */
/*  ⑦编写打印队列元素的子程序PrintNode( )；                                                                      */
/*  ⑧清空队列，连续3次做下列操作：入队4个元素，出队2个元素，打印队列，打印当前队列的队首元素和队尾元素；         */
/*  ⑨要求：提供尽可能友好的人机对话界面，便于用户（非程序设计者）使用。                                          */
/*      ****************************************************************************************************      */

#include "stdio.h"
#include "math.h"

/*下面为自行建立的自编子程序文件*/
#include "lab8h.h"

main()
{
  void PrintNode();

/*下面填写主程序*/




  getch();
}
